---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.Category
source: html/699d5136-c199-187c-fe09-368f2da7b31d.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.Category Property

The property labeled "Category" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string Category { get; }
```

## Remarks
This property is of type "AssetPropertyString".